OpenFOAM-2.4.0/tutorials/lagrangian/reactingParcelFoam/filter/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "1";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
    inlet
    {
        type            fixedValue;
        value           uniform ( 5 0 0 );
    }
    outlet
    {
        type            zeroGradient;
    }
    cycLeft_half0
    {
        type            cyclic;
    }
    cycRight_half0
    {
        type            cyclic;
    }
    frontAndBack
    {
        type            empty;
    }
    cycLeft_half1
    {
        type            cyclic;
    }
    cycRight_half1
    {
        type            cyclic;
    }
}


// ************************************************************************* //
